In [1]:
import pandas as pd

### 1)

* (i) DataFrame()=> to convert a datatype to dataframe

In [2]:
df = pd.DataFrame({"name":['abc','def','ghi','jkl','mno','pqr'],
                   "age":[20,34,56,78,90,12]})

* (ii) head()=> To print top elements

In [3]:
df.head()

  name  age
0  abc   20
1  def   34
2  ghi   56
3  jkl   78
4  mno   90

* (iii) tail()=> To print bottommost elements

In [4]:
df.tail()

  name  age
1  def   34
2  ghi   56
3  jkl   78
4  mno   90
5  pqr   12

* (iv) dtypes=> Tells datatypes of columns of dataframe

In [5]:
df.dtypes

name    object
age      int64
dtype: object

* (v) colums=> tells abt all columns present in dataframe

In [6]:
df.columns

Index(['name', 'age'], dtype='object')

### 2)

In [8]:
df1 = pd.DataFrame({"A":[1,2,3,4,5,6,7,8],"B":[9,101,11,12,13,14,15,16],
                    "C":[17,18,19,20,21,22,23,24] }, index = [1,3,5,7,9,11,13,15])

In [10]:
df1

    A    B   C
1   1    9  17
3   2  101  18
5   3   11  19
7   4   12  20
9   5   13  21
11  6   14  22
13  7   15  23
15  8   16  24

### 3)

In [11]:
df2 = pd.DataFrame({"Values":[10,20,30,40,50]})

In [12]:
df2

   Values
0      10
1      20
2      30
3      40
4      50

In [37]:
df3 = df2[0:3]

In [38]:
df3

   Values
0      10
1      20
2      30

In [40]:
sum = 0
for i in df3.Values:
    sum=sum+i
print(sum)

60

### 4)

In [41]:
df4 = pd.DataFrame({"Text":["This is","Data Science Course","Welcome to it"]})

In [42]:
df4

                  Text
0              This is
1  Data Science Course
2        Welcome to it

In [43]:
def word_cnt(x):
    return len(x.split())

In [44]:
df4['Word_Count'] = df4['Text'].apply(word_cnt)

In [45]:
df4

                  Text  Word_Count
0              This is           2
1  Data Science Course           3
2        Welcome to it           3

### 5)

* Dataframe.size => Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
* Dataframe.shape => Returns tuple of shape (Rows, columns) of dataframe/series

### 6)

* Pandas.read_excel() is used to read an excel file

### 7)

In [46]:
df5 = pd.DataFrame({"Email":["pwskilss@gmail.com","abcdef@gmail.com","datascns@yahoo.com",'john.doe@example.com']})

In [47]:
df5

                  Email
0    pwskilss@gmail.com
1      abcdef@gmail.com
2    datascns@yahoo.com
3  john.doe@example.com

In [48]:
def fetch_username(x):
    return x.split("@")[0]

In [49]:
df5['Username']=df5['Email'].apply(fetch_username)

In [50]:
df5

                  Email  Username
0    pwskilss@gmail.com  pwskilss
1      abcdef@gmail.com    abcdef
2    datascns@yahoo.com  datascns
3  john.doe@example.com  john.doe

### 8)

In [51]:
df6 = pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})

In [52]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [56]:
df7 = df6[(df6['A'] >5) & (df6['B'] <10)]

In [57]:
df7

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### 9)

In [58]:
df8 = pd.DataFrame({"Values":[10,20,30,40,50]})

In [59]:
df8

   Values
0      10
1      20
2      30
3      40
4      50

* Mean

In [60]:
df8['Values'].mean()

30.0

* Median

In [62]:
df8['Values'].median()

30.0

* Standard Deviation

In [63]:
df8['Values'].std()

15.811388300841896

### 10)

In [67]:
dates = pd.date_range("2022-09-01", "2022-09-15")

In [70]:
Sales = [234,678,981,267,190,256,981,145,980,567,349,167,109,450,900]

In [72]:
df9 = pd.DataFrame({"Dates":dates,"Sales":Sales})

In [73]:
df9

        Dates  Sales
0  2022-09-01    234
1  2022-09-02    678
2  2022-09-03    981
3  2022-09-04    267
4  2022-09-05    190
5  2022-09-06    256
6  2022-09-07    981
7  2022-09-08    145
8  2022-09-09    980
9  2022-09-10    567
10 2022-09-11    349
11 2022-09-12    167
12 2022-09-13    109
13 2022-09-14    450
14 2022-09-15    900

In [74]:
df9['MovingAverage'] = df9['Sales'].rolling(window=7).mean()

In [75]:
df9

        Dates  Sales  MovingAverage
0  2022-09-01    234            NaN
1  2022-09-02    678            NaN
2  2022-09-03    981            NaN
3  2022-09-04    267            NaN
4  2022-09-05    190            NaN
5  2022-09-06    256            NaN
6  2022-09-07    981     512.428571
7  2022-09-08    145     499.714286
8  2022-09-09    980     542.857143
9  2022-09-10    567     483.714286
10 2022-09-11    349     495.428571
11 2022-09-12    167     492.142857
12 2022-09-13    109     471.142857
13 2022-09-14    450     395.285714
14 2022-09-15    900     503.142857

### 11)

In [77]:
dates1 = pd.date_range("2023-01-01", "2023-01-05")

In [78]:
df10 = pd.DataFrame({"Dates":dates1})

In [79]:
df10

       Dates
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [80]:
df10.dtypes

Dates    datetime64[ns]
dtype: object

In [86]:
df10['Weekday'] = df10["Dates"].dt.day_name()

In [88]:
df10

       Dates    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### 12)

In [89]:
dates2 = pd.date_range("2023-01-01", "2023-02-25")

In [90]:
df11 = pd.DataFrame({"Dates":dates2})

In [94]:
df12 = df11[(df11["Dates"]>"2023-01-01") & (df11["Dates"]<"2023-01-31")]

In [95]:
df12

        Dates
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

### 13)

* To use the basic functions of pandas,the first and foremost necessary library that needs to
     be imported is Pandas